AvatarBg111/Diploma_project_CNC_machine/Software_STM32H750/CNC_control_panel_stm32h750/Core/Src/main.c
  /*Configure GPIO pins : TFT_D5_Pin TFT_D6_Pin TFT_D7_Pin TFT_D8_Pin
                           TFT_D9_Pin TFT_D10_Pin TFT_D11_Pin TFT_D12_Pin
                           TFT_D13_Pin */
  GPIO_InitStruct.Pin = TFT_D5_Pin|TFT_D6_Pin|TFT_D7_Pin|TFT_D8_Pin
                          |TFT_D9_Pin|TFT_D10_Pin|TFT_D11_Pin|TFT_D12_Pin
                          |TFT_D13_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : TEST_Pin */
  GPIO_InitStruct.Pin = TEST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(TEST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : USER_LED_B_Pin USER_LED_C_Pin USER_LED_D_Pin TFT_RESET_Pin
                           TFT_RD_Pin */
  GPIO_InitStruct.Pin = USER_LED_B_Pin|USER_LED_C_Pin|USER_LED_D_Pin|TFT_RESET_Pin
                          |TFT_RD_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI9_5_IRQn, 2, 0);
  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
/**
  * @brief Initialize interfaces
  */
void Init_interfaces(){
	// Enable system tick interrupt
	HAL_NVIC_SetPriority(SysTick_IRQn, 0x0, 0x1);
	HAL_NVIC_EnableIRQ(SysTick_IRQn);

	// Start GRBL UART reception with interrupts
	start_grbl_uart_reception();

	// Turn on screen back light
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);

	// Turn on encoder timer
	HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);

	// Start up TIM1 (timer for button de-bouncer)
	HAL_TIM_Base_Start_IT(&htim1);

	// Enable buzzer
	enable_buzzer();

	// Initialize touch screen controller
	Init_FT5436();

	// Initialize screen controller
	Init_R61529();
	R61529_SetRotation(ROTATE_DEFAULT);

	//Loading "Check/Test" step
	HAL_GPIO_WritePin(Board_LED_GPIO_Port, Board_LED_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(USER_LED_A_GPIO_Port, USER_LED_A_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(USER_LED_B_GPIO_Port, USER_LED_B_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(USER_LED_C_GPIO_Port, USER_LED_C_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(USER_LED_D_GPIO_Port, USER_LED_D_Pin, GPIO_PIN_SET);
	draw_loading_screen();
	HAL_GPIO_WritePin(Board_LED_GPIO_Port, Board_LED_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(USER_LED_A_GPIO_Port, USER_LED_A_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(USER_LED_B_GPIO_Port, USER_LED_B_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(USER_LED_C_GPIO_Port, USER_LED_C_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(USER_LED_D_GPIO_Port, USER_LED_D_Pin, GPIO_PIN_RESET);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
